<a href="https://colab.research.google.com/github/harikosaraju9/Data_612_assignments/blob/main/Week_3_HW_Data_612_Hari_Kosaraju.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [43]:
import pandas as pd
import numpy as np

In [44]:
## df= subset of original dataset created by professor and being used for homeworks
## df_E_Col = This dataset was created as part of week_2 assignment. New column month was added

df       = pd.read_csv("State_Drug_Utilization_Data_2010_Hari.csv", index_col=0)
df_E_Col = pd.read_csv("State_Drug.csv")

In [45]:
df.head()

        Utilization Type State  ...             Location          NDC
128037              FFSU    PA  ...  (35.5376, -96.9247)  50458055101
491755              FFSU    IN  ...  (40.3363, -89.0022)    378261010
2568076             FFSU    SD  ...   (18.2766, -66.335)  50242006201
491263              FFSU    WY  ...  (44.0407, -72.7093)     93738201
836489              MCOU    MN  ...  (43.3504, -84.5603)    904198359

[5 rows x 20 columns]

In [46]:
## Find the information about df dataframe.

df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 156219 entries, 128037 to 2029158
Data columns (total 20 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Utilization Type                156219 non-null  object
 1   State                           156219 non-null  object
 2   Labeler Code                    156219 non-null  int64
 3   Product Code                    156219 non-null  int64
 4   Package Size                    156219 non-null  int64
 5   Year                            156219 non-null  int64
 6   Quarter                         156219 non-null  int64
 7   Product Name                    156192 non-null  object
 8   Units Reimbursed                77002 non-null   float64
 9   Suppression Used                156219 non-null  bool
 10  Number of Prescriptions         77002 non-null   float64
 11  Total Amount Reimbursed         77002 non-null   float64
 12  Medicaid Amount Reimbursed      77002 non-null   float64
 13  Non Medicaid Amount Reimbursed  77002 non-null   float64
 14  Quarter Begin                   156219 non-null  object
 15  Quarter Begin Date              156219 non-null  object
 16  Latitude                        145178 non-null  float64
 17  Longitude                       145178 non-null  float64
 18  Location                        145178 non-null  object
 19  NDC                             156219 non-null  int64
dtypes: bool(1), float64(7), int64(6), object(6)
memory usage: 24.0+ MB

In [47]:
df_E_Col.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 156219 entries, 0 to 156218
Data columns (total 22 columns):
 #   Column                          Non-Null Count   Dtype
---  ------                          --------------   -----
 0   Utilization Type                156219 non-null  object
 1   State                           156219 non-null  object
 2   Labeler Code                    156219 non-null  int64
 3   Product Code                    156219 non-null  int64
 4   Package Size                    156219 non-null  int64
 5   Year                            156219 non-null  int64
 6   Quarter                         156219 non-null  int64
 7   Product Name                    156192 non-null  object
 8   Units Reimbursed                77002 non-null   float64
 9   Suppression Used                156219 non-null  bool
 10  Number of Prescriptions         77002 non-null   float64
 11  Total Amount Reimbursed         77002 non-null   float64
 12  Medicaid Amount Reimbursed      77002 non-null   float64
 13  Non Medicaid Amount Reimbursed  77002 non-null   float64
 14  Quarter Begin                   156219 non-null  object
 15  Quarter Begin Date              156219 non-null  object
 16  Latitude                        145178 non-null  float64
 17  Longitude                       145178 non-null  float64
 18  Location                        145178 non-null  object
 19  NDC                             156219 non-null  int64
 20  date_dt                         156219 non-null  object
 21  months                          156219 non-null  int64
dtypes: bool(1), float64(7), int64(7), object(7)
memory usage: 25.2+ MB

In [48]:
## count non-missing values in dataframe df.

print(df.count())

Utilization Type                  156219
State                             156219
Labeler Code                      156219
Product Code                      156219
Package Size                      156219
Year                              156219
Quarter                           156219
Product Name                      156192
Units Reimbursed                   77002
Suppression Used                  156219
Number of Prescriptions            77002
Total Amount Reimbursed            77002
Medicaid Amount Reimbursed         77002
Non Medicaid Amount Reimbursed     77002
Quarter Begin                     156219
Quarter Begin Date                156219
Latitude                          145178
Longitude                         145178
Location                          145178
NDC                               156219
dtype: int64

In [49]:
total_rows = df.shape[0]
print(total_rows)

156219

In [50]:
## missing values in df dataframe

missing = total_rows - df.count()
print(missing)

Utilization Type                      0
State                                 0
Labeler Code                          0
Product Code                          0
Package Size                          0
Year                                  0
Quarter                               0
Product Name                         27
Units Reimbursed                  79217
Suppression Used                      0
Number of Prescriptions           79217
Total Amount Reimbursed           79217
Medicaid Amount Reimbursed        79217
Non Medicaid Amount Reimbursed    79217
Quarter Begin                         0
Quarter Begin Date                    0
Latitude                          11041
Longitude                         11041
Location                          11041
NDC                                   0
dtype: int64

##  Splitting df dataframe into three small dataframes df1, df2, and df3.
### And their information.

In [51]:
## createing df1 dataframe from df with random_state = 3

df1 = df.sample(frac=0.10, replace=True,random_state=3)

In [52]:
## information about df1 dataframe

df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 15622 entries, 428522 to 488690
Data columns (total 20 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                15622 non-null  object
 1   State                           15622 non-null  object
 2   Labeler Code                    15622 non-null  int64
 3   Product Code                    15622 non-null  int64
 4   Package Size                    15622 non-null  int64
 5   Year                            15622 non-null  int64
 6   Quarter                         15622 non-null  int64
 7   Product Name                    15621 non-null  object
 8   Units Reimbursed                7658 non-null   float64
 9   Suppression Used                15622 non-null  bool
 10  Number of Prescriptions         7658 non-null   float64
 11  Total Amount Reimbursed         7658 non-null   float64
 12  Medicaid Amount Reimbursed      7658 non-null   float64
 13  Non Medicaid Amount Reimbursed  7658 non-null   float64
 14  Quarter Begin                   15622 non-null  object
 15  Quarter Begin Date              15622 non-null  object
 16  Latitude                        14590 non-null  float64
 17  Longitude                       14590 non-null  float64
 18  Location                        14590 non-null  object
 19  NDC                             15622 non-null  int64
dtypes: bool(1), float64(7), int64(6), object(6)
memory usage: 2.4+ MB

In [53]:
## creating df2 from dataframe df with random state = 1

df2=df.sample(frac=0.05, replace=True,random_state=1)

In [54]:
## df2 dataframe information

df2.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 7811 entries, 297796 to 1927959
Data columns (total 20 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                7811 non-null   object
 1   State                           7811 non-null   object
 2   Labeler Code                    7811 non-null   int64
 3   Product Code                    7811 non-null   int64
 4   Package Size                    7811 non-null   int64
 5   Year                            7811 non-null   int64
 6   Quarter                         7811 non-null   int64
 7   Product Name                    7810 non-null   object
 8   Units Reimbursed                3783 non-null   float64
 9   Suppression Used                7811 non-null   bool
 10  Number of Prescriptions         3783 non-null   float64
 11  Total Amount Reimbursed         3783 non-null   float64
 12  Medicaid Amount Reimbursed      3783 non-null   float64
 13  Non Medicaid Amount Reimbursed  3783 non-null   float64
 14  Quarter Begin                   7811 non-null   object
 15  Quarter Begin Date              7811 non-null   object
 16  Latitude                        7272 non-null   float64
 17  Longitude                       7272 non-null   float64
 18  Location                        7272 non-null   object
 19  NDC                             7811 non-null   int64
dtypes: bool(1), float64(7), int64(6), object(6)
memory usage: 1.2+ MB

In [55]:
## creating df3 from dataframe df with random state = 6

df3 = df.sample(frac=0.06, replace=True,random_state=6)

In [56]:
## information about df3 dataframe

df3.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 9373 entries, 2349874 to 1742602
Data columns (total 20 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                9373 non-null   object
 1   State                           9373 non-null   object
 2   Labeler Code                    9373 non-null   int64
 3   Product Code                    9373 non-null   int64
 4   Package Size                    9373 non-null   int64
 5   Year                            9373 non-null   int64
 6   Quarter                         9373 non-null   int64
 7   Product Name                    9369 non-null   object
 8   Units Reimbursed                4626 non-null   float64
 9   Suppression Used                9373 non-null   bool
 10  Number of Prescriptions         4626 non-null   float64
 11  Total Amount Reimbursed         4626 non-null   float64
 12  Medicaid Amount Reimbursed      4626 non-null   float64
 13  Non Medicaid Amount Reimbursed  4626 non-null   float64
 14  Quarter Begin                   9373 non-null   object
 15  Quarter Begin Date              9373 non-null   object
 16  Latitude                        8728 non-null   float64
 17  Longitude                       8728 non-null   float64
 18  Location                        8728 non-null   object
 19  NDC                             9373 non-null   int64
dtypes: bool(1), float64(7), int64(6), object(6)
memory usage: 1.4+ MB

## Concatenating df1, df2, d3

In [57]:
row_concat=pd.concat([df1,df2,df3], ignore_index=True)
row_concat.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32806 entries, 0 to 32805
Data columns (total 20 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                32806 non-null  object
 1   State                           32806 non-null  object
 2   Labeler Code                    32806 non-null  int64
 3   Product Code                    32806 non-null  int64
 4   Package Size                    32806 non-null  int64
 5   Year                            32806 non-null  int64
 6   Quarter                         32806 non-null  int64
 7   Product Name                    32800 non-null  object
 8   Units Reimbursed                16067 non-null  float64
 9   Suppression Used                32806 non-null  bool
 10  Number of Prescriptions         16067 non-null  float64
 11  Total Amount Reimbursed         16067 non-null  float64
 12  Medicaid Amount Reimbursed      16067 non-null  float64
 13  Non Medicaid Amount Reimbursed  16067 non-null  float64
 14  Quarter Begin                   32806 non-null  object
 15  Quarter Begin Date              32806 non-null  object
 16  Latitude                        30590 non-null  float64
 17  Longitude                       30590 non-null  float64
 18  Location                        30590 non-null  object
 19  NDC                             32806 non-null  int64
dtypes: bool(1), float64(7), int64(6), object(6)
memory usage: 4.8+ MB

In [58]:
len(row_concat)

32806

In [59]:
## removing duplicate rows if any picked during split in dataframe df into three dataframes

row_concat.drop_duplicates()
len(row_concat)

32806

In [60]:
## selected 21 % of the dataset which has extra column 'month' 
## now both data sets have 32806 records 

df_E_1 = df_E_Col.sample(frac=0.21, replace=True,random_state=8)

In [61]:
len(df_E_1)
df_E_1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 32806 entries, 70083 to 64713
Data columns (total 22 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                32806 non-null  object
 1   State                           32806 non-null  object
 2   Labeler Code                    32806 non-null  int64
 3   Product Code                    32806 non-null  int64
 4   Package Size                    32806 non-null  int64
 5   Year                            32806 non-null  int64
 6   Quarter                         32806 non-null  int64
 7   Product Name                    32799 non-null  object
 8   Units Reimbursed                16194 non-null  float64
 9   Suppression Used                32806 non-null  bool
 10  Number of Prescriptions         16194 non-null  float64
 11  Total Amount Reimbursed         16194 non-null  float64
 12  Medicaid Amount Reimbursed      16194 non-null  float64
 13  Non Medicaid Amount Reimbursed  16194 non-null  float64
 14  Quarter Begin                   32806 non-null  object
 15  Quarter Begin Date              32806 non-null  object
 16  Latitude                        30463 non-null  float64
 17  Longitude                       30463 non-null  float64
 18  Location                        30463 non-null  object
 19  NDC                             32806 non-null  int64
 20  date_dt                         32806 non-null  object
 21  months                          32806 non-null  int64
dtypes: bool(1), float64(7), int64(7), object(7)
memory usage: 5.5+ MB

## Concatenate two dataframes row_concat & df_E_1.

In [62]:
concat_dfs = pd.concat([row_concat, df_E_1], ignore_index=True)

In [63]:
concat_dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65612 entries, 0 to 65611
Data columns (total 22 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                65612 non-null  object
 1   State                           65612 non-null  object
 2   Labeler Code                    65612 non-null  int64
 3   Product Code                    65612 non-null  int64
 4   Package Size                    65612 non-null  int64
 5   Year                            65612 non-null  int64
 6   Quarter                         65612 non-null  int64
 7   Product Name                    65599 non-null  object
 8   Units Reimbursed                32261 non-null  float64
 9   Suppression Used                65612 non-null  bool
 10  Number of Prescriptions         32261 non-null  float64
 11  Total Amount Reimbursed         32261 non-null  float64
 12  Medicaid Amount Reimbursed      32261 non-null  float64
 13  Non Medicaid Amount Reimbursed  32261 non-null  float64
 14  Quarter Begin                   65612 non-null  object
 15  Quarter Begin Date              65612 non-null  object
 16  Latitude                        61053 non-null  float64
 17  Longitude                       61053 non-null  float64
 18  Location                        61053 non-null  object
 19  NDC                             65612 non-null  int64
 20  date_dt                         32806 non-null  object
 21  months                          32806 non-null  float64
dtypes: bool(1), float64(8), int64(6), object(7)
memory usage: 10.6+ MB

In [64]:
concat_dfs.head()

  Utilization Type State  Labeler Code  ...          NDC  date_dt  months
0             FFSU    XX         24385  ...  24385035740      NaN     NaN
1             FFSU    CO           378  ...    378072419      NaN     NaN
2             FFSU    OH         13668  ...  13668026805      NaN     NaN
3             MCOU    KS           591  ...    591079501      NaN     NaN
4             FFSU    NC           409  ...    409359002      NaN     NaN

[5 rows x 22 columns]

## Replace missing values in new colums 'month' and 'date_dt' with values.

In [65]:
## use fillna() method to fill 01/01/0001 in missing values for date_dt
## use fillna method() to fill 0 value in months value

concat_dfs["date_dt"].fillna("01/01/0001", inplace=True)
concat_dfs["months"].fillna(0, inplace=True)

In [66]:
concat_dfs.head()

  Utilization Type State  Labeler Code  ...          NDC     date_dt  months
0             FFSU    XX         24385  ...  24385035740  01/01/0001     0.0
1             FFSU    CO           378  ...    378072419  01/01/0001     0.0
2             FFSU    OH         13668  ...  13668026805  01/01/0001     0.0
3             MCOU    KS           591  ...    591079501  01/01/0001     0.0
4             FFSU    NC           409  ...    409359002  01/01/0001     0.0

[5 rows x 22 columns]

In [67]:
concat_dfs.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65612 entries, 0 to 65611
Data columns (total 22 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                65612 non-null  object
 1   State                           65612 non-null  object
 2   Labeler Code                    65612 non-null  int64
 3   Product Code                    65612 non-null  int64
 4   Package Size                    65612 non-null  int64
 5   Year                            65612 non-null  int64
 6   Quarter                         65612 non-null  int64
 7   Product Name                    65599 non-null  object
 8   Units Reimbursed                32261 non-null  float64
 9   Suppression Used                65612 non-null  bool
 10  Number of Prescriptions         32261 non-null  float64
 11  Total Amount Reimbursed         32261 non-null  float64
 12  Medicaid Amount Reimbursed      32261 non-null  float64
 13  Non Medicaid Amount Reimbursed  32261 non-null  float64
 14  Quarter Begin                   65612 non-null  object
 15  Quarter Begin Date              65612 non-null  object
 16  Latitude                        61053 non-null  float64
 17  Longitude                       61053 non-null  float64
 18  Location                        61053 non-null  object
 19  NDC                             65612 non-null  int64
 20  date_dt                         65612 non-null  object
 21  months                          65612 non-null  float64
dtypes: bool(1), float64(8), int64(6), object(7)
memory usage: 10.6+ MB

In [76]:
print(concat_dfs.count())

Utilization Type                  65612
State                             65612
Labeler Code                      65612
Product Code                      65612
Package Size                      65612
Year                              65612
Quarter                           65612
Product Name                      65612
Units Reimbursed                  32261
Suppression Used                  65612
Number of Prescriptions           32261
Total Amount Reimbursed           32261
Medicaid Amount Reimbursed        32261
Non Medicaid Amount Reimbursed    32261
Quarter Begin                     65612
Quarter Begin Date                65612
Latitude                          61053
Longitude                         61053
Location                          65612
NDC                               65612
date_dt                           65612
months                            65612
dtype: int64

In [78]:
n_rows = concat_dfs.shape[0]
n_missing = n_rows - concat_dfs.count()
print(n_missing)

Utilization Type                      0
State                                 0
Labeler Code                          0
Product Code                          0
Package Size                          0
Year                                  0
Quarter                               0
Product Name                          0
Units Reimbursed                  33351
Suppression Used                      0
Number of Prescriptions           33351
Total Amount Reimbursed           33351
Medicaid Amount Reimbursed        33351
Non Medicaid Amount Reimbursed    33351
Quarter Begin                         0
Quarter Begin Date                    0
Latitude                           4559
Longitude                          4559
Location                              0
NDC                                   0
date_dt                               0
months                                0
dtype: int64

We see the missing values in above table.

##Taking care of missing values.

In [68]:
concat_df_interpolate = concat_dfs.interpolate()

In [69]:
concat_df_interpolate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65612 entries, 0 to 65611
Data columns (total 22 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                65612 non-null  object
 1   State                           65612 non-null  object
 2   Labeler Code                    65612 non-null  int64
 3   Product Code                    65612 non-null  int64
 4   Package Size                    65612 non-null  int64
 5   Year                            65612 non-null  int64
 6   Quarter                         65612 non-null  int64
 7   Product Name                    65599 non-null  object
 8   Units Reimbursed                65612 non-null  float64
 9   Suppression Used                65612 non-null  bool
 10  Number of Prescriptions         65612 non-null  float64
 11  Total Amount Reimbursed         65612 non-null  float64
 12  Medicaid Amount Reimbursed      65612 non-null  float64
 13  Non Medicaid Amount Reimbursed  65612 non-null  float64
 14  Quarter Begin                   65612 non-null  object
 15  Quarter Begin Date              65612 non-null  object
 16  Latitude                        65611 non-null  float64
 17  Longitude                       65611 non-null  float64
 18  Location                        61053 non-null  object
 19  NDC                             65612 non-null  int64
 20  date_dt                         65612 non-null  object
 21  months                          65612 non-null  float64
dtypes: bool(1), float64(8), int64(6), object(7)
memory usage: 10.6+ MB

From the above information, we still see missing values in columns 'Product Name', 'latitude', 'longitude', and 'location'.

In [75]:
print(concat_df_interpolate.count())

Utilization Type                  65612
State                             65612
Labeler Code                      65612
Product Code                      65612
Package Size                      65612
Year                              65612
Quarter                           65612
Product Name                      65612
Units Reimbursed                  65612
Suppression Used                  65612
Number of Prescriptions           65612
Total Amount Reimbursed           65612
Medicaid Amount Reimbursed        65612
Non Medicaid Amount Reimbursed    65612
Quarter Begin                     65612
Quarter Begin Date                65612
Latitude                          65612
Longitude                         65612
Location                          65612
NDC                               65612
date_dt                           65612
months                            65612
dtype: int64

In [70]:
concat_df_interpolate["Location"].fillna("(0.00, 0.00)", inplace=True)
concat_df_interpolate["Latitude"].fillna(0, inplace=True)
concat_df_interpolate["Longitude"].fillna(0, inplace=True)
concat_df_interpolate["Product Name"].fillna("No product name", inplace=True)

In [71]:
concat_df_interpolate.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65612 entries, 0 to 65611
Data columns (total 22 columns):
 #   Column                          Non-Null Count  Dtype
---  ------                          --------------  -----
 0   Utilization Type                65612 non-null  object
 1   State                           65612 non-null  object
 2   Labeler Code                    65612 non-null  int64
 3   Product Code                    65612 non-null  int64
 4   Package Size                    65612 non-null  int64
 5   Year                            65612 non-null  int64
 6   Quarter                         65612 non-null  int64
 7   Product Name                    65612 non-null  object
 8   Units Reimbursed                65612 non-null  float64
 9   Suppression Used                65612 non-null  bool
 10  Number of Prescriptions         65612 non-null  float64
 11  Total Amount Reimbursed         65612 non-null  float64
 12  Medicaid Amount Reimbursed      65612 non-null  float64
 13  Non Medicaid Amount Reimbursed  65612 non-null  float64
 14  Quarter Begin                   65612 non-null  object
 15  Quarter Begin Date              65612 non-null  object
 16  Latitude                        65612 non-null  float64
 17  Longitude                       65612 non-null  float64
 18  Location                        65612 non-null  object
 19  NDC                             65612 non-null  int64
 20  date_dt                         65612 non-null  object
 21  months                          65612 non-null  float64
dtypes: bool(1), float64(8), int64(6), object(7)
memory usage: 10.6+ MB

From above dataframe information, we see that the dataframe is clean with no missing values.